Autodesk.Revit.DB.Curve.IsClosed
Describes whether the curve is closed.
Remarks: A curve is "closed" if it is bounded and its start and end points coincide (to within Revit's 3D tolerance),
or if it is unbounded and periodic.
Since: 2021